package interesting;

/*
生日悖论：
i = 2, 重复概率: 0.002739726027397249
i = 3, 重复概率: 0.008204165884781345
i = 4, 重复概率: 0.016355912466550215
i = 5, 重复概率: 0.02713557369979347
i = 6, 重复概率: 0.040462483649111425
i = 7, 重复概率: 0.056235703095975365
i = 8, 重复概率: 0.07433529235166902
i = 9, 重复概率: 0.09462383388916673
i = 10, 重复概率: 0.11694817771107768
i = 11, 重复概率: 0.14114137832173312
i = 12, 重复概率: 0.1670247888380645
i = 13, 重复概率: 0.19441027523242949
i = 14, 重复概率: 0.2231025120049731
i = 15, 重复概率: 0.25290131976368646
i = 16, 重复概率: 0.28360400525285
i = 17, 重复概率: 0.31500766529656077
i = 18, 重复概率: 0.3469114178717895
i = 19, 重复概率: 0.37911852603153684
i = 20, 重复概率: 0.41143838358058016
i = 21, 重复概率: 0.4436883351652059
i = 22, 重复概率: 0.4756953076625502
i = 23, 重复概率: 0.5072972343239854
i = 24, 重复概率: 0.5383442579145288
i = 25, 重复概率: 0.5686997039694639
i = 26, 重复概率: 0.598240820135939
i = 27, 重复概率: 0.626859282263242
i = 28, 重复概率: 0.6544614723423994
i = 29, 重复概率: 0.680968537477777
 */
public class Birthday {
    public static void main(String[] args) {
        for (int i = 2; i < 30; ++i) {
            System.out.println("i = " + i + ", 重复概率: " + (1 - func(i)));
        }
    }

    private static double func(int k) {
        if (k <= 1) {
            return 0;
        }
        double ans = 1;
        for (int i = 1; i <= k - 1; ++i) {
            ans *= (1 - (double) i / 365.0);
        }
        return ans;
    }
}
